systems/laptop/Laptop.org
#+title: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+EXPORT_FILE_NAME: README.org
#+INCLUDE "../common/startup.org"

* Welcome stranger!

This is part of my current and ever evolving effort to configure my systems and the software that run on them. Right now it is single page and long document, part of the plan is to modularize theese documents for code reuse and my mental health.

It is written in Emacs as an Org Mode document. Emacs is at the center of this effort with git in a supporting role. Which means that the org-mode files are the source of truth.
From the org-mode files we configure the rest of the system. I will add some bootstrap information in each of the files. It is mostly the same approach on all systems.
install minimal NixOS or GNU Guix systems following install follow the repective manuals -> clone git ->configure emacs -> configure systems -> reboot.

The [[file:init.el][init.el]], [[file:][README.org]] and different config files are generated from this file.

*NOTE:* symlink your init.el file to ~/.emacs.d/init.el

#+begin_src shell
  ln -s ~/systems/laptop/init.el ~/emacs.d/init.el
#+end_src

This one is used to configure mt laptop.
My laptop runs GNU Guix with Gnome and exwm as window managers.

*NOTE:* Inspired by [[https://github.com/daviwil/emacs-from-scratch/][Emacs from scratch by System Crafters]]

* Bootstrap

Boostrapping my systems involves installing NixOs in a predictable way so that configuring them is jus git clone -> symlink -> rebuild -> reboot -> apply Emacs config. TODO how to handle secrets(ssh-keys and gpg keys)

#+begin_src shell 
  
#+end_src

* Tips

Here there will be some comments on hoe to use this file

* Emacs startup performance

** Make Emacs print out the time it used to start up.

#+begin_src emacs-lisp

  (defun geokkjer/display-startup-time ()
    (message "Emacs loaded in %s with %d grabage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'geokkjer/display-startup-time)

#+end_src

** Garbage collection

#+begin_src emacs-lisp

  (setq gc-cons-threshold (* 50 1000 1000))
  
#+end_src

* UI config

Setting up the emacs ui to my liking.

** Basic

Turn off the startup-message makes emcas launch into the scratch buffer.
Turn off some UI elements, like scroll-bar and menu-bar.
And turn off the bell to visual, no audible bell.

#+begin_src emacs-lisp

  ;; Turns off the startup-message
  (setq inhibit-startup-message t)

  ;; Disable UI-elements
  (scroll-bar-mode -1)  ; Disable visible scrollbar
  (tool-bar-mode -1)    ; Disable the toolbar
  (tooltip-mode -1)     ; Disable tooltips
  (set-fringe-mode 10)  ; Give us some breathing room

  (menu-bar-mode -1)    ; Disable the menu bar

  ;; Set up the visual bell
  (setq visible-bell t)

  ;; Setting to auto reload files
  (setq auto-revert-mode t)

#+end_src

** Doom modline and all-the-icons

Use doom-modeline, set height. Install all-the-icons and use doom-themes to set a nice theme. Sometimes needed "M-x all-the-icons-install-fonts"

#+begin_src emacs-lisp

  ;; Doom modline, all-the-icons and doom-theme
  (use-package doom-modeline
    :ensure t
    :hook (after-init . doom-modeline-mode)
    :custom ((doom-modeline-height 15)))

  (use-package all-the-icons)

  (use-package doom-themes
    :init (load-theme 'doom-dracula t))

#+end_src

** Line numbers

Set emacs to show line-numbers, some modes excluded.

#+begin_src emacs-lisp

  ;; Enable line numbers
  

  (column-number-mode)
  (global-display-line-numbers-mode t)

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
		  term-mode-hook
		  shell-mode-hook
		  vterm-mode-hook
		  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** Command Log mode

Shows key commands in a pane. :commands ensures that the package is loade when the command is invoked and not before.

#+begin_src emacs-lisp

  (use-package command-log-mode
    :commands command-log-mode)
  
#+end_src

* Font configuration

I like the MesloLGS Nerd and the Fira Code fonts, it fits nicely with the theme and my zsh prompt.

#+begin_src emacs-lisp
  
  (defvar geokkjer/default-font-size 140)

  (set-face-attribute 'default nil :font "Fira Code" :height geokkjer/default-font-size)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height 140)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font "MesloLGS NF" :height 130 :weight 'regular)

#+end_src

* Package System setup

Setting up some packaging registers for emacs.

** Package sources and initialization.

#+begin_src emacs-lisp

  ;; Initialize package sources
  (require 'package)

  ;; Set the repos
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("nongnu" . "https://elpa.nongnu.org/nongnu/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package in case we are on non-Linux platform
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

** Auto-update packages

#+begin_src emacs-lisp

  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00"))

#+end_src

** Keep the folders clean

This is where I will put some things to keep my .emacs.d folder clean

#+begin_src emacs-lisp

;;  (use-package no-littering)
  
;;  (setq auto-save-file-name-transforms
;;        '((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src

* Swiper and Ivy

Install and setup Ivy and swiper. Some keybindings for both swiper and counsel. which-key and ivy-rich.

** Swiper

#+begin_src emacs-lisp

  (use-package swiper)


#+end_src

** Ivy

#+begin_src emacs-lisp

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-reverse-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reversee-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

#+end_src

** Counsel

#+begin_src emacs-lisp

    (use-package counsel
      :bind (("M-x" . counsel-M-x)
             ("C-x b" . counsel-ibuffer)
             ("C-x C-f" . counsel-find-file)
             :map minibuffer-local-map
             ("C-r" .'counsel-minibuffer-history))
      :config
      (setq ivy-initial-inputs-alist nil)
      (counsel-mode 1))

#+end_src

** Which key

#+begin_src emacs-lisp

  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))

  #+end_src

* Org-mode

Org-mode configuration :TODO Redo, it work but more work is needed

