emacs/init.el

;; Org-agenda config

(setq org-agenda-start-with-log-mode t)
(setq org-log-done 'time)
(setq org-log-into-drawer t)
(setq org-agenda-files
    '("~/Projects/Code/dotfiles/emacs/OrgFiles/Tasks.org"
        "~/Projects/Code/dotfiles/emacs/OrgFiles/Birthdays.org"
        "~/Projects/Code/dotfiles/emacs/OrgFiles/Habits.org"))

(require 'org-habit)
(add-to-list 'org-modules 'org-habit)
(setq org-habit-graph-column 60)

(setq org-refile-targets
    '(("Archive.org" :maxlevel . 1)
        ("Tasks.org" :maxlevel . 1)))

;; Save Org buffers after refiling!
(advice-add 'org-refile :after 'org-save-all-org-buffers)

(setq org-tag-alist
    '((:startgroup)
        ;; Put mutually exclusive tags here
        (:endgroup)
        ("@errand" . ?E)
        ("@home" . ?H)
        ("@work" . ?W)
        ("agenda" . ?a)
        ("planning" . ?p)
        ("publish" . ?P)
        ("batch" . ?b)
        ("note" . ?n)
        ("idea" . ?i)))

;; Configure custom agenda views
(setq org-agenda-custom-commands
    '(("d" "Dashboard"
        ((agenda "" ((org-deadline-warning-days 7)))
        (todo "NEXT"
                ((org-agenda-overriding-header "Next Tasks")))
        (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active
Projects")))))

        ("n" "Next Tasks"
        ((todo "NEXT"
                ((org-agenda-overriding-header "Next Tasks")))))

        ("W" "Work Tasks" tags-todo "+work-email")

        ;; Low-effort next actions
        ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
        ((org-agenda-overriding-header "Low Effort Tasks")
        (org-agenda-max-todos 20)
        (org-agenda-files org-agenda-files)))

        ("w" "Workflow Status"
        ((todo "WAIT"
                ((org-agenda-overriding-header "Waiting on External")
                (org-agenda-files org-agenda-files)))
        (todo "REVIEW"
                ((org-agenda-overriding-header "In Review")
                (org-agenda-files org-agenda-files)))
        (todo "PLAN"
                ((org-agenda-overriding-header "In Planning")
                (org-agenda-todo-list-sublevels nil)
                (org-agenda-files org-agenda-files)))
        (todo "BACKLOG"
                ((org-agenda-overriding-header "Project Backlog")
                (org-agenda-todo-list-sublevels nil)
                (org-agenda-files org-agenda-files)))
        (todo "READY"
                ((org-agenda-overriding-header "Ready for Work")
                (org-agenda-files org-agenda-files)))
        (todo "ACTIVE"
                ((org-agenda-overriding-header "Active Projects")
                (org-agenda-files org-agenda-files)))
        (todo "COMPLETED"
                ((org-agenda-overriding-header "Completed Projects")
                (org-agenda-files org-agenda-files)))
        (todo "CANC"
                ((org-agenda-overriding-header "Cancelled Projects")
                (org-agenda-files org-agenda-files)))))))


(setq org-capture-templates
    `(("t" "Tasks / Projects")
        ("tt" "Task" entry (file+olp
                            "~/Projects/Code/dotfiles/emacs/OrgFiles/Tasks.org"
                            "Inbox")
        "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

        ("j" "Journal Entries")
        ("jj" "Journal" entry
        (file+olp+datetree
        "~/Projects/Code/dotfiles/emacs/OrgFiles/Journal.org")
        "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
        ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
        :clock-in :clock-resume
        :empty-lines 1)
        ("jm" "Meeting" entry
        (file+olp+datetree
        "~/Projects/Code/dotfiles/emacs/OrgFiles/Journal.org")
        "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
        :clock-in :clock-resume
        :empty-lines 1)

        ("w" "Workflows")
        ("we" "Checking Email" entry (file+olp+date
                                    "~/Projects/Code/dotfiles/emacs/OrgFiles/Journal.org")
        "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines
        1)

        ("m" "Metrics Capture")
        ("mw" "Weight" table-line (file+headline
                                    "~/Projects/Code/dotfiles/emacs/OrgFiles/Metrics.org" "Weight")
        "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))

(define-key global-map (kbd "C-c j")
(lambda () (interactive) (org-capture nil "jj")))

(efs/org-font-setup)

(defun geokkjer/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook ((lsp-mode . geokkjer/lsp-mode-setup)
         (lsp-mode . lsp-enable-which-key-integration))
  :init
  (setq lsp-keymap-prefix "C-c l"))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-psition 'bottom))

(setq lsp-ui-sidline-enable nil)
(setq lsp-ui-sideline-show-hover nil)

(use-package lsp-treemacs
  :after lsp)
