systems/laptop/Laptop.org
* Hydra


#+begin_src emacs-lisp

  (use-package hydra
    :defer t)
  
  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (geokkjer/leader-keys
    "ts" '(hydra-text-scale/body :which-key "scale text"))

#+end_src

* Shells and Terminals

** term-mode

#+begin_src emacs-lisp

  (use-package term
    :commands term
    :config
    (setq explicit-shell-file-name "bash")
    ;; (setq explicit-zsh-args '())
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

#+end_src

** vterm

TODO
I used the package from NixOS repository rather than compile from source.

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-vterm"

#+end_src

#+begin_src emacs-lisp


  (use-package vterm
    :ensure t
    :commands vterm
    :config
    (setq vterm-shell "bash")
    (setq vterm-max-scrollback 10000))

#+end_src

** eshell

built in shell written for emacs TODO:completions

#+begin_src emacs-lisp

  (defun geokkjer/configure-eshell ()
    ;; Make eshell svae history when it is open  
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell-git-prompt
    :after eshell)

  (use-package eshell
    :hook (eshell-first-time-mode . geokkjer/configure-eshell)
    :config
    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-process-dies t)
      (setq eshell-visual-commands '("htop" "zsh" "vim" "glances")))

    (eshell-git-prompt-use-theme 'powerline))

#+end_src

* File Management

** Dired

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-up-directory
      "l" 'dired-single-buffer))

  (use-package dired-single
    :after dired)

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired-open
    :after dired
    :config
    (setq dired-open-exstensions '(("png" . "feh")
                                   ("mkv" . "mpv"))))
  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))

#+end_src

* Window Managers
** ix3
** EXVM

EXVM is Emacs as a Window Manager

*** Write the Desktop file and link it on non nixos/guix systems

NOTE: For installation on traditional Linux distros like Ubuntu:

#+begin_src conf-unix :tangle ~/dotfiles/exwm/exwm.desktop
[Desktop Entry]
Name=EXWM
Comment=Emacs Window Manager
Exec=sh /home/geir/dotfiles/emacs/exvm/start-exwm.sh
TryExec=sh
Type=Application
X-LightDM-DesktopName=exwm
DesktopNames=exwm
#+end_src

#+begin_src shell :dir "/sudo::"
 sudo ln -f ~/dotfiles/exwm/exwm.desktop  /usr/share/xsessions/exwm.desktop 
#+end_src

#+begin_src shell :tangle ~/dotfiles/exwm/start-exwm.sh
  #!/bin/sh  

  # start EXWM --mm maximize emacs --debug-init drop into debugger
  
  exec dbus-launch --exit-with-session emacs -mm --debug-init

#+end_src

NOTE: On GNU Guix add "emacs-exwm" "emacs-desktop-environmet" to your config.scm
NOTE: TODO NixOS

*** Configuration

NOTE: remember to install Xmodmap on your distro

Configure CapsLock to act as CTRL

#+begin_src conf-unix :tangle ~/dotfiles/exwm/Xmodmap

  clear lock
  clear control
  keycode 66 = Control_L
  add control = Control_L
  add Lock = Control_R
  
#+end_src

Use arandr to get screenresolution(s), usually saves to .screenlayout/yourfile

Use xrandr to set screenresolution(s), copy the xrandr line from the file and paste it into the "start-process-shell-command "xrandr" nil" expression below. 

This is a basic configuration for EXWM

#+begin_src emacs-lisp

  (defun geokkjer/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))

  (use-package exwm
    :config
    ;; Set the default number of workspaces
    (setq exwm-workspace-number 5)

    ;; When window "class" updates, use it to set the buffer name
    (add-hook 'exwm-update-class-hook #'geokkjer/exwm-update-class)

    ;; Rebind CapsLock to Ctrl
    (start-process-shell-command "xmodmap" nil "xmodmap ~/dofiles/exwm/Xmodmap")

    ;; Set the screen resolution (update this to be the correct resolution for your screen!)
    (require 'exwm-randr)
    (exwm-randr-enable)
    (start-process-shell-command "xrandr" nil "xrandr --output eDP --primary --mode 1920x1080 --pos 0x0 --rotate normal --output HDMI-A-0 --off")

    ;; Load the system tray before exwm-init
    (require 'exwm-systemtray)
    (exwm-systemtray-enable)

    ;; These keys should always pass through to Emacs
    (setq exwm-input-prefix-keys
          '(?\C-x
            ?\C-u
            ?\C-h
            ?\M-x
            ?\M-`
            ?\M-&
            ?\M-:
            ?\C-\M-j  ;; Buffer list
            ?\C-\ ))  ;; Ctrl+Space

    ;; Ctrl+Q will enable the next key to be sent directly
    (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

    ;; Set up global key bindings.  These always work, no matter the input state!
    ;; Keep in mind that changing this list after EXWM initializes has no effect.
    (setq exwm-input-global-keys
          `(
            ;; Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
            ([?\s-r] . exwm-reset)

            ;; move between windows
            ([s-left] . windmove-left)
            ([s-right] . windmove-right)
            ([s-up] . windmove-up)
            ([s-down] . windmove-down)

            ;; Launch applications via shell command
            ([?\s-&] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))

            ;; Switch workspace
            ([?\s-w] . exwm-workspace-switch)
            ([?\s-'] . (lambda () (interactive) (exwm-workspace-switch-create 0)))

            ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
            ,@(mapcar (lambda (i)
                        `(,(kbd (format "s-%d" i)) .
                          (lambda ()
                            (interactive)
                            (exwm-workspace-switch-create ,i))))
                      (number-sequence 0 9))))

    (exwm-enable))

#+end_src

** StumpWM
** Xmonad
** Sway
* Other Applications examples

Using emacs org-mode to configure other applications.

*** Some app

#+begin_src conf-unix :tangle .config/some-app :mkdirp yes
      (+ 42 42)
#+end_src

* Runtime performance
#+begin_src emacs-lisp

  ;; Make gc pauses faster by decreasing the threshold
  (setq gc-cons-threshold (* 2 1000 1000))
  
#+end_src
