emacs/init.el

(use-package hydra)
(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(geokkjer/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))

(use-package term
  :config
  (setq explicit-shell-file-name "bash")
  ;; (setq explicit-zsh-args '())
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

(use-package vterm
  :commands vterm
  :config
  ;; (setq vterm-shell "zsh")
  (setq vterm-max-scrollback 10000))
